sdaiResetArrayIndex(Sdai_Id_aggr*,System.UInt32,System.UInt32)
\details
Resets the index for a specified array: changes the lower and upper bounds of the index value.
\param sdaiArray [in] An array.
\param lower     [in] A new lower index value to be set.
\param upper     [in] A new upper index value to be set.
\remarks
Possible error codes:
* sdaiSS_NOPN - Session is not open.
* sdaiTR_NAVL - Transaction currently not available.
* sdaiTR_EAB - Transaction ended abnormally.
* sdaiRP_NOPN - Repository is not open.
* sdaiMX_NDEF - SDAI-model access not defined.
* sdaiAI_NEXS - Aggregate instance does not exist.
* sdaiAI_NVLD - Aggregate instance invalid.
* sdaiVA_NVLD - Value invalid.
* sdaiVT_NVLD - Value type invalid.
* sdaiFN_NAVL - Function not available.
* sdaiSY_ERR - Underlying system error.
\code
SdaiAppInstance arrayInstance = sdaiCreateInstanceBN(sdaiModel, "testarrayinstance");
SdaiArray intArray = sdaiCreateAggrBN(arrayInstance, "IntArray");
sdaiGetLowerIndex(intArray); // == -2
sdaiGetUpperIndex(intArray); // == 5
sdaiResetArrayIndex(intArray, -4, 3);
sdaiGetLowerIndex(intArray); // == -4
sdaiGetUpperIndex(intArray); // == 3